{
  "brand": "Shelzy's Designs",
  "products": [
    {
      "asin": "B0DGFD4LX4",
      "sku": "1M-GGRA-VBRF",
      "name": "Clear Plastic Water Bottle",
      "type": "personalized",
      "listing": {
        "title": "Shelzy's Designs Personalized Water Bottle with Name - 25oz Custom Tumbler for Bridesmaid Gift, Bachelorette Party Favors - Clear BPA Free Plastic, Flip Top Straw - Wedding Bridal Shower Gift for Women",
        "bullet_points": [
          "PERSONALIZED WITH YOUR NAME - Make every sip special with a custom water bottle featuring the recipient's name in beautiful, permanent sublimation printing. Unlike cheap vinyl stickers that peel and fade, our sublimation process infuses the design directly into the coating for a smooth, professional finish that lasts for years.",
          "PERFECT BRIDESMAID & BACHELORETTE GIFT - Searching for unique bridesmaid proposal gifts or bachelorette party favors? These personalized tumblers are the ideal way to ask 'Will you be my bridesmaid?' or celebrate with your bride tribe. Each bottle arrives ready for gifting at bridal showers, wedding parties, and girls' weekends.",
          "GENEROUS 25OZ CAPACITY - Stay hydrated all day with this large-capacity tumbler that holds plenty of your favorite beverage. The convenient flip-top lid with built-in straw makes drinking easy whether you're getting ready for the big day, traveling to destination weddings, or simply staying refreshed.",
          "BPA-FREE CLEAR PLASTIC DESIGN - Crafted from premium, BPA-free clear plastic that's lightweight yet durable. The transparent design lets you see your drink levels at a glance, while the sturdy construction withstands daily use from busy bridesmaids and bachelorette party adventures.",
          "WOMEN-OWNED SMALL BUSINESS - When you shop Shelzy's Designs, you're supporting a women-owned small business dedicated to creating memorable, personalized gifts. We take pride in every custom order, ensuring each water bottle meets our high standards for quality and personalization."
        ],
        "description": "Celebrate your special moments with Shelzy's Designs Personalized Water Bottles - the perfect gift for bridesmaids, bachelorette parties, and wedding celebrations. Each 25oz tumbler features permanent sublimation printing that won't peel, crack, or fade like vinyl alternatives. Our BPA-free clear plastic design is both beautiful and practical, with a convenient flip-top straw lid for easy sipping. Whether you're planning a bridal shower, asking your best friends to be bridesmaids, or creating memorable bachelorette party favors, these custom tumblers make every celebration more special. Proudly created by a women-owned small business.",
        "search_terms": "bridesmaid personalized bridesmaid gift bachelorette bride tribe maid of honor bridal shower wedding favor personalized gift custom tumbler custom water bottle wedding party gift bridal party tumbler bachelorette party favors bridesmaid proposal gift women gift"
      }
    },
    {
      "asin": "B0D92Q5R1P",
      "sku": "2A-PQ74-FWLU",
      "name": "Stainless Steel Water Bottle",
      "type": "personalized",
      "listing": {
        "title": "Shelzy's Designs Personalized Stainless Steel Water Bottle with Name - 25oz Custom Insulated Tumbler for Bridesmaid Gift, Bachelorette Party - Flip Top Straw, Wedding Bridal Shower Gift for Women",
        "bullet_points": [
          "CUSTOM NAME PERSONALIZATION - Elevate your gift-giving with a stunning personalized stainless steel water bottle. Our professional sublimation printing permanently bonds your custom text to the bottle's coating, creating a smooth, vibrant finish that outlasts vinyl decals and never peels or cracks.",
          "THE ULTIMATE BRIDESMAID GIFT - Make your proposal unforgettable with personalized tumblers for your bridal party. These custom insulated bottles are perfect bridesmaid proposal gifts, maid of honor presents, or bachelorette party favors that your bride tribe will actually use and treasure long after the wedding.",
          "DOUBLE-WALL INSULATED 25OZ - Keep drinks cold for up to 24 hours or hot for 12 hours with premium double-wall vacuum insulation. The generous 25-ounce capacity ensures your bridesmaids stay hydrated throughout wedding prep, rehearsal dinners, and the big day itself.",
          "PREMIUM STAINLESS STEEL CONSTRUCTION - Built to last with high-quality 18/8 stainless steel that won't retain flavors or odors. The sleek design features a convenient flip-top lid with integrated straw for spill-resistant sipping at bridal showers, bachelorette weekends, and everyday adventures.",
          "WOMEN-OWNED BUSINESS QUALITY - Shelzy's Designs is a proud women-owned small business committed to exceptional personalized gifts. Every custom bottle is carefully crafted with attention to detail, making each piece a cherished keepsake for weddings, celebrations, and special occasions."
        ],
        "description": "Make your wedding celebrations unforgettable with Shelzy's Designs Personalized Stainless Steel Water Bottles. Each 25oz insulated tumbler features premium double-wall vacuum construction that keeps drinks cold for 24 hours or hot for 12 hours. Our permanent sublimation printing creates stunning personalization that won't peel or fade like vinyl alternatives. Perfect for bridesmaid proposals, bachelorette parties, bridal showers, and wedding party gifts. The flip-top straw lid ensures convenient, spill-resistant sipping for busy bridesmaids and bachelorette adventures. Proudly handcrafted by a women-owned small business dedicated to quality personalized gifts.",
        "search_terms": "bridesmaid personalized bridesmaid gift bachelorette bride tribe maid of honor bridal shower wedding favor personalized gift custom tumbler insulated water bottle wedding party gift bridal party tumbler stainless steel personalized bachelorette party favors bridesmaid proposal women gift"
      }
    },
    {
      "asin": "B0FH3T8QHD",
      "sku": "BLANK-TMBLR",
      "name": "Sublimation Blank Tumbler",
      "type": "blank",
      "listing": {
        "title": "Shelzy's Designs Sublimation Blank Tumbler 25oz - White Stainless Steel Water Bottle for Heat Press, DIY Craft Projects - Double Wall Insulated, Flip Top Straw - Bulk Crafting Supplies for Small Business",
        "bullet_points": [
          "PREMIUM SUBLIMATION-READY COATING - Our 25oz white tumblers feature a professional-grade sublimation coating designed for vibrant, full-coverage heat press transfers. The smooth, consistent finish ensures your designs print beautifully with rich colors and sharp details every time.",
          "PERFECT FOR HEAT PRESS PROJECTS - Crafters and small business owners trust our sublimation blanks for creating custom tumblers, personalized gifts, and wholesale products. Compatible with standard 20oz shrink wrap sleeves and convection ovens, these blanks deliver professional results at home.",
          "DOUBLE-WALL INSULATED STAINLESS STEEL - Built with premium 18/8 stainless steel construction and vacuum insulation that keeps drinks cold 24 hours or hot 12 hours. Your finished products will impress customers with both beautiful designs and functional quality.",
          "CONVENIENT FLIP-TOP STRAW LID - Each blank includes a durable flip-top lid with integrated straw for spill-resistant drinking. The practical design makes these perfect for creating personalized gifts, wedding favors, team tumblers, and small business inventory.",
          "BULK CRAFTING SUPPLIES FROM SMALL BUSINESS - Shelzy's Designs understands crafters because we ARE crafters. Our sublimation blanks meet the quality standards of professional personalization businesses while supporting a women-owned small business that knows what creators need."
        ],
        "description": "Start your sublimation crafting business or expand your inventory with Shelzy's Designs premium 25oz Sublimation Blank Tumblers. Our white stainless steel water bottles feature a professional sublimation-ready coating that produces vibrant, lasting prints with your heat press. Double-wall vacuum insulation keeps drinks at the perfect temperature, while the included flip-top straw lid adds functional value to your finished products. Perfect for creating personalized gifts, wedding party favors, team merchandise, and small business inventory. Each tumbler is quality-checked to ensure consistent coating coverage for professional results every time.",
        "search_terms": "sublimation blanks sublimation blanks tumbler sublimation water bottle blank white tumbler for sublimation heat press tumbler blank sublimation tumbler blanks 20oz 25oz craft supplies bulk blanks DIY tumbler personalization business supplies crafting small business crafter heat transfer"
      }
    }
  ]
}
