{
  "brand": "Shelzy's Designs",
  "products": [
    {
      "asin": "B0D92Q5R1P",
      "sku": "SZ-SS-CUSTOM-20",
      "name": "Personalized Stainless Steel Water Bottle",
      "type": "personalized",
      "customizable": true,
      "options": {
        "name": "up to 20 characters",
        "font": ["Script Elegant", "Modern Sans", "Bold Block", "Handwritten", "Classic Serif"],
        "color": ["Gold", "Rose Gold", "Silver", "Black", "White", "Pink", "Navy", "Sage Green"]
      },
      "listing": {
        "title": "Shelzy's Designs Personalized Water Bottle 20oz - Custom Name, Font & Color - Stainless Steel Double-Wall Insulated - Leak-Proof Flip Straw - Bridesmaid Gift, Bachelorette, Wedding Party Favor",
        "bullet_points": [
          "FULLY CUSTOMIZABLE: Your name (up to 20 characters), YOUR choice of 5 elegant fonts (Script, Modern Sans, Bold Block, Handwritten, Classic Serif), and YOUR favorite print color from 8 stunning options including Gold, Rose Gold, Sage Green, and more. Create a bottle that's uniquely yours.",
          "PERMANENT SUBLIMATION PRINTING: Unlike cheap vinyl stickers that peel, crack, and fade, our professional sublimation process infuses the design directly INTO the bottle's coating. Your personalization becomes part of the bottle - smooth to the touch, dishwasher safe, and guaranteed to last for years.",
          "PREMIUM DOUBLE-WALL INSULATION: 18/8 stainless steel construction with vacuum insulation keeps drinks ice cold for 24 hours or hot for 12 hours. No more lukewarm water at the gym or cold coffee on your commute. The powder-coated exterior is sweat-free and won't leave rings on your desk.",
          "LEAK-PROOF & TRAVEL-READY: Secure flip-top lid with silicone seal prevents spills in your bag, backpack, or purse. The integrated straw makes sipping easy while driving, working out, or chasing kids. BPA-free, rust-resistant, and built tough for daily adventures.",
          "PERFECT PERSONALIZED GIFT: Ideal for bridesmaids, maid of honor, bachelorette parties, wedding favors, teacher appreciation, nurses, sports teams, or anyone who deserves something special. Ships in beautiful gift-ready packaging. Proudly designed by a women-owned small business in New York."
        ],
        "description": "Make hydration personal with Shelzy's Designs Personalized Stainless Steel Water Bottle. This 20oz insulated tumbler features YOUR custom name in YOUR choice of font and color - creating a one-of-a-kind bottle you'll actually love using. Our permanent sublimation printing infuses the design directly into the bottle's coating (no vinyl stickers!), so your personalization is smooth, dishwasher safe, and built to last. Premium double-wall vacuum insulation keeps drinks cold 24 hours or hot 12 hours. The leak-proof flip-top lid with integrated straw is perfect for busy days. Whether you're gifting bridesmaids, celebrating bachelorettes, or treating yourself, this custom tumbler makes every sip special. Designed with love by a women-owned small business.",
        "search_terms": "personalized water bottle custom name tumbler bridesmaid gift bachelorette party favor wedding bridal shower maid of honor gift for women stainless steel insulated tumbler custom font custom color sublimation print personalized gift teacher nurse gift team"
      },
      "images": [
        "hero-bridal-party-5.webp",
        "flatlay-bride-pink.png",
        "product-elegant-bridal.png",
        "lifestyle-bridal-intimate.webp",
        "gallery-beach-lineup.png"
      ],
      "price": 24.99,
      "compare_at_price": 34.99
    },
    {
      "asin": "B0DGFD4LX4",
      "sku": "SZ-CLR-CUSTOM-24",
      "name": "Personalized Clear Water Bottle",
      "type": "personalized",
      "customizable": true,
      "options": {
        "name": "up to 20 characters",
        "font": ["Script Elegant", "Modern Sans", "Bold Block", "Handwritten", "Classic Serif"],
        "color": ["Gold", "Rose Gold", "Silver", "Black", "White", "Pink", "Navy", "Sage Green"]
      },
      "listing": {
        "title": "Shelzy's Designs Personalized Clear Water Bottle 24oz - Custom Name, Font & Color - BPA-Free Lightweight Plastic - Wide Mouth Flip Straw - Perfect for Gym, School, Office, Bachelorette",
        "bullet_points": [
          "FULLY CUSTOMIZABLE: Add YOUR name (up to 20 characters), choose from 5 stylish fonts, and pick YOUR print color from 8 vibrant options including Gold, Rose Gold, Pink, and Sage Green. Design a bottle that matches your personality and style.",
          "CRYSTAL CLEAR DESIGN: See-through BPA-free plastic lets you track your water intake throughout the day - watch yourself hit your hydration goals! The lightweight 24oz capacity is perfect for all-day sipping without weighing down your bag.",
          "PERMANENT SUBLIMATION PRINTING: Our professional sublimation process creates personalization that's literally part of the bottle. No peeling vinyl, no fading text - just a smooth, vibrant design that withstands daily use, washing, and time.",
          "PRACTICAL EVERYDAY FEATURES: Wide mouth opening makes it easy to fill, add ice cubes, and clean thoroughly. The secure flip-top lid with integrated straw is perfect for one-handed sipping at the gym, during meetings, or while multitasking.",
          "AFFORDABLE PERSONALIZED GIFT: Great value for gym buddies, coworkers, students, bachelorette parties, or yourself. Each bottle arrives in cute packaging ready to gift. Designed with love by a women-owned small business committed to quality."
        ],
        "description": "Stay hydrated in style with Shelzy's Designs Personalized Clear Water Bottle. This 24oz BPA-free bottle features YOUR custom name in YOUR choice of font and color. Our permanent sublimation printing won't peel or fade like vinyl stickers. The crystal-clear design lets you see your water level while the lightweight construction is perfect for gym bags, backpacks, and daily carry. Wide mouth for easy filling and ice, flip-top straw for convenient sipping. An affordable personalized gift for gym lovers, students, coworkers, bachelorette parties, or yourself. Proudly designed by a women-owned small business.",
        "search_terms": "personalized clear water bottle custom name tumbler bpa free gym bottle school water bottle bachelorette party favor lightweight tumbler custom font custom color see through water bottle hydration tracker office bottle women gift affordable personalized gift"
      },
      "images": [
        "product-studio-colorful.png",
        "lifestyle-bachelorette.webp",
        "lifestyle-friends-couch.png",
        "product-hand-holding.png"
      ],
      "price": 19.99,
      "compare_at_price": 29.99
    },
    {
      "asin": "B0FH3T8QHD",
      "sku": "SZ-SS-WHITE-20",
      "name": "Stainless Steel Water Bottle - White",
      "type": "blank",
      "customizable": false,
      "listing": {
        "title": "Shelzy's Designs Stainless Steel Water Bottle 20oz White - Double-Wall Vacuum Insulated - Keeps Drinks Cold 24hrs Hot 12hrs - Leak-Proof Flip Straw - BPA-Free, Sweat-Proof",
        "bullet_points": [
          "PREMIUM QUALITY BUILD: 18/8 stainless steel construction with elegant powder-coated white finish. Built to last through years of daily use - from morning coffee to post-workout hydration. Rust-resistant, BPA-free, and dishwasher safe.",
          "SUPERIOR TEMPERATURE CONTROL: Double-wall vacuum insulation technology keeps drinks ice cold for 24 hours or hot for 12 hours. No more lukewarm beverages - enjoy the perfect temperature whenever you take a sip.",
          "CLEAN MINIMAL DESIGN: Sleek white finish goes with everything. Perfect for those who appreciate understated elegance and quality craftsmanship. A timeless look that never goes out of style.",
          "LEAK-PROOF & SWEAT-FREE: Secure flip-top lid with silicone seal prevents spills. The insulated walls mean no condensation - your desk, bag, and hands stay dry. Integrated straw for convenient sipping on the go.",
          "PERFECT 20OZ SIZE: Not too big, not too small - the ideal capacity for desk, gym, commute, or daily adventures. Fits standard cup holders and most bag pockets. Great standalone bottle or perfect for DIY sublimation crafters."
        ],
        "description": "Sometimes you just want a great water bottle without the fuss. The Shelzy's Designs 20oz Stainless Steel Water Bottle delivers premium quality in a clean, classic white design. Double-wall vacuum insulation keeps drinks cold 24 hours or hot 12 hours. The powder-coated finish is sweat-free and grippy. Leak-proof flip-top lid with integrated straw for convenient sipping. 18/8 stainless steel construction is BPA-free, rust-resistant, and built to last. Perfect as a daily driver or as a sublimation blank for crafters. From a women-owned small business that values quality.",
        "search_terms": "white water bottle stainless steel insulated tumbler 20oz vacuum insulated cold hot leak proof sweat free powder coated minimal design gym bottle office tumbler sublimation blank white tumbler crafting supplies"
      },
      "images": [
        "product-single-blue.png",
        "lifestyle-couple-outdoor.webp"
      ],
      "price": 18.99,
      "compare_at_price": 24.99
    },
    {
      "asin": "PENDING-CLR-PLAIN",
      "sku": "SZ-CLR-PLAIN-24",
      "name": "Clear Water Bottle - Plain",
      "type": "blank",
      "customizable": false,
      "listing": {
        "title": "Shelzy's Designs Clear Water Bottle 24oz - BPA-Free Lightweight Plastic - Wide Mouth Flip-Top Lid - Perfect for Gym, School, Office, Daily Hydration",
        "bullet_points": [
          "SIMPLE & FUNCTIONAL: No-frills clear water bottle that does exactly what you need. See your water level at a glance and track your daily hydration progress. Clean design for those who appreciate simplicity.",
          "BPA-FREE SAFETY: Crafted from premium BPA-free plastic that's safe for the whole family. Feel good about your daily hydration knowing your bottle is free from harmful chemicals.",
          "ULTRA LIGHTWEIGHT: At only 0.35 lbs, this 24oz bottle is perfect for gym bags, backpacks, school lockers, and purses. You'll barely notice it until you need it - then you'll be glad it's there.",
          "PRACTICAL DESIGN: Wide mouth opening makes filling easy and accommodates ice cubes. Flip-top lid for one-handed drinking. Simple construction means easy cleaning - no complicated parts.",
          "GREAT VALUE: Quality hydration without breaking the bank. Stock up for the whole family, classroom, office, or sports team. Each bottle is built to last through daily use and regular washing."
        ],
        "description": "The Shelzy's Designs 24oz Clear Water Bottle is hydration made simple. No bells and whistles - just a quality BPA-free bottle that lets you see your water level and stay on track with your hydration goals. Ultra-lightweight for easy carrying, wide mouth for easy filling, and a practical flip-top lid for convenient sipping. Perfect for gym workouts, school days, office hydration, or anywhere you need reliable water access. Stock up for the whole family, team, or classroom. From a women-owned small business that believes good hydration doesn't need to be complicated.",
        "search_terms": "clear water bottle bpa free gym bottle school water bottle lightweight cheap water bottle simple water bottle bulk water bottle family pack office water bottle hydration see through bottle wide mouth flip top"
      },
      "images": [
        "product-studio-colorful.png"
      ],
      "price": 12.99,
      "compare_at_price": 17.99
    }
  ]
}
